// 搜索数字验证
muban.vfed.二级.title = 'h1&&Text;.fed-col-md3--span:eq(0)&&Text';
muban.vfed.二级.desc = '.fed-col-md3:eq(3)&&Text;;;.fed-col-md6:eq(0)&&Text;.fed-col-md6--span:eq(1)&&Text';
var rule = {
title: '冷曦影视',
模板:'vfed',
host: 'https://www.lenxi.vip',
// url: '/s/fyclass--------fypage---.html',
url: '/s/fyfilter.html',
filterable:1,//是否启用分类筛选,
filter_url:'{{fl.cateId}}-{{fl.area}}-{{fl.by}}-{{fl.class}}-----fypage---{{fl.year}}',



"zhibo":[{"key":"cateId","name":"分类","value":[{"n":"全部","v":""},{"n":"电影直播","v":"dianyingzhibo"},{"n":"卫视直播","v":"weishizhibo"},{"n":"央视直播","v":"yangshizhibo"}]},{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"大陆","v":"大陆"},{"n":"香港","v":"香港"},{"n":"台湾","v":"台湾"},{"n":"美国","v":"美国"},{"n":"韩国","v":"韩国"},{"n":"日本","v":"日本"},{"n":"泰国","v":"泰国"},{"n":"其它","v":"其它"}]},{"key":"year","name":"年代","value":[{"n":"全部","v":""},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"2010","v":"2010"},{"n":"2009","v":"2009"},{"n":"2008","v":"2008"},{"n":"2007","v":"2007"},{"n":"2006","v":"2006"},{"n":"2005","v":"2005"},{"n":"2004","v":"2004"},{"n":"2003","v":"2003"},{"n":"2002","v":"2002"},{"n":"2001","v":"2001"},{"n":"2000","v":"2000"}]},{"key":"by","name":"排序","value":[{"n":"时间","v":"time"},{"n":"人气","v":"hits"},{"n":"评分","v":"score"}]}],
"dianyingjieshuo":[{"key":"class","name":"类型","value":[{"n":"全部","v":""},{"n":"电影解说","v":"电影解说"},{"n":"解说","v":"解说"}]},{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"大陆","v":"大陆"},{"n":"香港","v":"香港"},{"n":"台湾","v":"台湾"},{"n":"美国","v":"美国"},{"n":"韩国","v":"韩国"},{"n":"日本","v":"日本"},{"n":"泰国","v":"泰国"},{"n":"其它","v":"其它"}]},{"key":"year","name":"年代","value":[{"n":"全部","v":""},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"2010","v":"2010"},{"n":"2009","v":"2009"},{"n":"2008","v":"2008"},{"n":"2007","v":"2007"},{"n":"2006","v":"2006"},{"n":"2005","v":"2005"},{"n":"2004","v":"2004"},{"n":"2003","v":"2003"},{"n":"2002","v":"2002"},{"n":"2001","v":"2001"},{"n":"2000","v":"2000"}]},{"key":"by","name":"排序","value":[{"n":"时间","v":"time"},{"n":"人气","v":"hits"},{"n":"评分","v":"score"}]}],
"tiyu":[{"key":"class","name":"类型","value":[{"n":"全部","v":""},{"n":"WWE摔跤娱乐","v":"WWE摔跤娱乐"},{"n":"赛车","v":"赛车"},{"n":"UFC终极格斗","v":"UFC终极格斗"},{"n":"网球","v":"网球"},{"n":"篮球","v":"篮球"},{"n":"足球","v":"足球"},{"n":"自行车","v":"自行车"},{"n":"棒球","v":"棒球"},{"n":"摩托车","v":"摩托车"},{"n":"橄榄球","v":"橄榄球"},{"n":"MMA综合格斗","v":"MMA综合格斗"},{"n":"台球","v":"台球"},{"n":"高尔夫","v":"高尔夫"},{"n":"拳击","v":"拳击"}]},{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"大陆","v":"大陆"},{"n":"香港","v":"香港"},{"n":"台湾","v":"台湾"},{"n":"美国","v":"美国"},{"n":"韩国","v":"韩国"},{"n":"日本","v":"日本"},{"n":"泰国","v":"泰国"},{"n":"其它","v":"其它"}]},{"key":"year","name":"年代","value":[{"n":"全部","v":""},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"2010","v":"2010"},{"n":"2009","v":"2009"},{"n":"2008","v":"2008"},{"n":"2007","v":"2007"},{"n":"2006","v":"2006"},{"n":"2005","v":"2005"},{"n":"2004","v":"2004"},{"n":"2003","v":"2003"},{"n":"2002","v":"2002"},{"n":"2001","v":"2001"},{"n":"2000","v":"2000"}]},{"key":"by","name":"排序","value":[{"n":"时间","v":"time"},{"n":"人气","v":"hits"},{"n":"评分","v":"score"}]}]
},
filter_def:{
movie:{cateId:'movie'},
tv:{cateId:'tv'},
zongyi:{cateId:'zongyi'},
dongman:{cateId:'dongman'},
fuli:{cateId:'fuli'},
zhibo:{cateId:'zhibo'},
dianyingjieshuo:{cateId:'dianyingjieshuo'},
tiyu:{cateId:'tiyu'}
},
class_parse: '.fed-pops-list:eq(0)&&li:gt(0):lt(8);a&&Text;a&&href;.*/(.*?).html',
cate_exclude:'福利',

// searchUrl:'/sou/**----------fypage---.html',
searchUrl:'/index.php/ajax/suggest?mid=1&wd=**',
detailUrl:'/v/fyid.html', //非必填,二级详情拼接链接
搜索:'json:list;name;pic;;id',
}